## MySQL Connector

In [20]:
# !pip install mysql-connector-python

In [21]:
import mysql.connector

databases = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "mysql@123"
)

print(databases)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000231016799D0>

Creating an instance of 'cursor' class which is used to execute the 'SQL' statements in 'Python'

In [22]:
cursor = databases.cursor()

cursor.execute(
    "drop database practise;"
)

In [23]:
cursor = databases.cursor()

cursor.execute(
    "create database practise;"
)

In [24]:
cursor = databases.cursor()

cursor.execute(
    "SHOW databases;"
)

for x in cursor:
    print(x)

('client_rw',)
('fc_facts',)
('information_schema',)
('mysql',)
('performance_schema',)
('practise',)
('sakila',)
('sys',)
('transaction',)
('world',)

In [25]:
databases.close()

In [26]:
mydb = mysql.connector.Connect(
    host = "localhost",
    user = "root",
    password = "mysql@123",
    database = "practise"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002310168EAB0>

In [27]:
mycursor = mydb.cursor()

In [28]:
mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

In [29]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('customers',)

In [30]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)

mydb.commit()
print(mycursor.rowcount, "record inserted.")

1 record inserted.

mydb.commit() is required to make the changes, otherwise no changes are made to the table.

Insert multiple rows: second parameter of the executemany() method is a list of tuples, containing the data you want to insert:

In [31]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

fetchall() method, which fetches all rows from the last executed statement.

fetchone() method will return the first row of the result

In [32]:
mycursor.execute("SELECT name, address FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')

In [33]:
import pandas as pd
df = pd.read_sql(sql='SELECT * FROM customers', con = mydb)
df.head()

C:\Users\Ngawang Gurung\AppData\Local\Temp\ipykernel_14840\2929433888.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql='SELECT * FROM customers', con = mydb)

      name       address
0     John    Highway 21
1    Peter   Lowstreet 4
2      Amy  Apple st 652
3   Hannah   Mountain 21
4  Michael    Valley 345

In [34]:
df['name_lowercase'] = df['name'].apply(lambda x: x.lower())
df.head()

      name       address name_lowercase
0     John    Highway 21           john
1    Peter   Lowstreet 4          peter
2      Amy  Apple st 652            amy
3   Hannah   Mountain 21         hannah
4  Michael    Valley 345        michael

In [35]:
mydb.close()

In [36]:
from sqlalchemy import create_engine
import pandas as pd
from urllib.parse import quote

engine = create_engine("mysql+mysqlconnector://root:%s@localhost:3306/practise" %quote('mysql@123'))
con = engine.connect()

df.to_sql('customers', con=engine, if_exists='replace', index=False)

14

In [37]:

df = pd.read_sql(sql='SELECT * FROM customers', con = engine)
df.head()

      name       address name_lowercase
0     John    Highway 21           john
1    Peter   Lowstreet 4          peter
2      Amy  Apple st 652            amy
3   Hannah   Mountain 21         hannah
4  Michael    Valley 345        michael